{"class_name": "Model", "config": {"name": "model_51", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1/conv", "class_name": "Conv2D", "config": {"name": "conv1/conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "conv1/bn", "class_name": "BatchNormalization", "config": {"name": "conv1/bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv1/conv", 0, 0, {}]]]}, {"name": "conv1/relu", "class_name": "Activation", "config": {"name": "conv1/relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv1/bn", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv1/relu", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "conv2_block1_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "conv2_block1_0_relu", "class_name": "Activation", "config": {"name": "conv2_block1_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]]}, {"name": "conv2_block1_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]]}, {"name": "conv2_block1_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block1_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"name": "conv2_block1_1_relu", "class_name": "Activation", "config": {"name": "conv2_block1_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"name": "conv2_block1_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block1_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"name": "conv2_block1_concat", "class_name": "Concatenate", "config": {"name": "conv2_block1_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]]}, {"name": "conv2_block2_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]]}, {"name": "conv2_block2_0_relu", "class_name": "Activation", "config": {"name": "conv2_block2_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]]}, {"name": "conv2_block2_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]]}, {"name": "conv2_block2_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block2_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"name": "conv2_block2_1_relu", "class_name": "Activation", "config": {"name": "conv2_block2_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"name": "conv2_block2_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block2_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"name": "conv2_block2_concat", "class_name": "Concatenate", "config": {"name": "conv2_block2_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]]}, {"name": "conv2_block3_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]]}, {"name": "conv2_block3_0_relu", "class_name": "Activation", "config": {"name": "conv2_block3_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]]}, {"name": "conv2_block3_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]]}, {"name": "conv2_block3_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block3_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"name": "conv2_block3_1_relu", "class_name": "Activation", "config": {"name": "conv2_block3_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"name": "conv2_block3_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block3_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"name": "conv2_block3_concat", "class_name": "Concatenate", "config": {"name": "conv2_block3_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]]}, {"name": "conv2_block4_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block4_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]]}, {"name": "conv2_block4_0_relu", "class_name": "Activation", "config": {"name": "conv2_block4_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]]}, {"name": "conv2_block4_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block4_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]]}, {"name": "conv2_block4_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block4_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]]}, {"name": "conv2_block4_1_relu", "class_name": "Activation", "config": {"name": "conv2_block4_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]]}, {"name": "conv2_block4_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block4_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]]}, {"name": "conv2_block4_concat", "class_name": "Concatenate", "config": {"name": "conv2_block4_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]]}, {"name": "conv2_block5_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block5_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]]}, {"name": "conv2_block5_0_relu", "class_name": "Activation", "config": {"name": "conv2_block5_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]]}, {"name": "conv2_block5_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block5_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]]}, {"name": "conv2_block5_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block5_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]]}, {"name": "conv2_block5_1_relu", "class_name": "Activation", "config": {"name": "conv2_block5_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]]}, {"name": "conv2_block5_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block5_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]]}, {"name": "conv2_block5_concat", "class_name": "Concatenate", "config": {"name": "conv2_block5_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]]}, {"name": "conv2_block6_0_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block6_0_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]]}, {"name": "conv2_block6_0_relu", "class_name": "Activation", "config": {"name": "conv2_block6_0_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]]}, {"name": "conv2_block6_1_conv", "class_name": "Conv2D", "config": {"name": "conv2_block6_1_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]]}, {"name": "conv2_block6_1_bn", "class_name": "BatchNormalization", "config": {"name": "conv2_block6_1_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]]}, {"name": "conv2_block6_1_relu", "class_name": "Activation", "config": {"name": "conv2_block6_1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]]}, {"name": "conv2_block6_2_conv", "class_name": "Conv2D", "config": {"name": "conv2_block6_2_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]]}, {"name": "conv2_block6_concat", "class_name": "Concatenate", "config": {"name": "conv2_block6_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]]}, {"name": "pool2_bn", "class_name": "BatchNormalization", "config": {"name": "pool2_bn", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1.001e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["pool2_bn", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}