{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}], "input_layers": [["input_1", 0, 0]], "output_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}