{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "conv2d_6_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "conv2d_6_input"}, "inbound_nodes": []}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 96, "kernel_size": [11, 11], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_6_input", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}], "input_layers": [["conv2d_6_input", 0, 0]], "output_layers": [["activation_10", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}